In [1]:
import pandas as pd

In [2]:
a={ "name":["zerooo","kamal","Geetero"], 
    "id"  :["1","2","3"],
    "dept":["CSE","IT","AIDS"] }

In [4]:
df=pd.DataFrame(a)
df

      name id  dept
0   zerooo  1   CSE
1    kamal  2    IT
2  Geetero  3  AIDS

In [5]:
df.iloc[[0,1]]

     name id dept
0  zerooo  1  CSE
1   kamal  2   IT

In [7]:
df.loc[[0,1],["id","dept"]]

  id dept
0  1  CSE
1  2   IT

In [9]:
df=pd.read_csv("Housing (1).csv")
df

,price,area,bedrooms,bathrooms,stories,mainroad,guestroom,basement,hotwaterheating,airconditioning,parking,prefarea,furnishingstatus
0,13300000,7420,4,2,3,yes,no,no,no,yes,2,yes,furnished
1,12250000,8960,4,4,4,yes,no,no,no,yes,3,no,furnished
2,12250000,9960,3,2,2,yes,no,yes,no,no,2,yes,semi-furnished
3,12215000,7500,4,2,2,yes,no,yes,no,yes,3,yes,furnished
4,11410000,7420,4,1,2,yes,yes,yes,no,yes,2,no,furnished
...,...,...,...,...,...,...,...,...,...,...,...,...,...
540,1820000,3000,2,1,1,yes,no,yes,no,no,2,no,unfurnished
541,1767150,2400,3,1,1,no,no,no,no,no,0,no,semi-furnished
542,1750000,3620,2,1,1,yes,no,no,no,no,0,no,unfurnished
543,1750000,2910,3,1,1,no,no,no,no,no,0,no,furnished
544,1750000,3850,3,1,2,yes,no,no,no,no,0,no,unfurnished

In [10]:
df['price']

0      13300000
1      12250000
2      12250000
3      12215000
4      11410000
         ...
540     1820000
541     1767150
542     1750000
543     1750000
544     1750000
Name: price, Length: 545, dtype: int64

In [11]:
df.loc[0]

price                13300000
area                     7420
bedrooms                    4
bathrooms                   2
stories                     3
mainroad                  yes
guestroom                  no
basement                   no
hotwaterheating            no
airconditioning           yes
parking                     2
prefarea                  yes
furnishingstatus    furnished
Name: 0, dtype: object

In [12]:
df.loc[0,"price"]

13300000

In [13]:
df.loc[[0,1,2],["price"]]

      price
0  13300000
1  12250000
2  12250000

In [14]:
# Slicing

In [15]:
df.loc[0:2,"furnishingstatus"]

0         furnished
1         furnished
2    semi-furnished
Name: furnishingstatus, dtype: object

In [16]:
df.loc[0:2,"price":"basement"]

      price  area  bedrooms  bathrooms  stories mainroad guestroom basement
0  13300000  7420         4          2        3      yes        no       no
1  12250000  8960         4          4        4      yes        no       no
2  12250000  9960         3          2        2      yes        no      yes